### Pandas DataFrame

In [66]:
import numpy as np
import pandas as pd

In [67]:
temp = np.random.randint(low = 20, high = 100, size = [20,])
name = np.random.choice(['Abhay', 'Teclov', 'Geekshub', 'Ankit'], 20)
random = np.random.choice([10, 11, 13, 12, 14], 20)

In [68]:
a = list(zip(temp, name, random))

In [69]:
df = pd.DataFrame(a, columns = ['temp', 'name', 'random'])

In [70]:
df

    temp      name  random
0     23     Ankit      13
1     87    Teclov      10
2     84  Geekshub      14
3     51     Abhay      11
4     87    Teclov      14
5     80    Teclov      14
6     58     Ankit      14
7     92     Abhay      12
8     53     Ankit      11
9     80     Abhay      11
10    49    Teclov      13
11    59  Geekshub      11
12    46     Ankit      13
13    93     Abhay      12
14    28     Ankit      11
15    55    Teclov      10
16    53     Ankit      13
17    38  Geekshub      10
18    85     Abhay      14
19    74    Teclov      12

In [71]:
type(df)

pandas.core.frame.DataFrame

In [72]:
# creating DataFrame using dictionary
df = pd.DataFrame({'temp':temp , 'name':name, 'random':random})

In [73]:
type(df)

pandas.core.frame.DataFrame

In [74]:
df.head()

   temp      name  random
0    23     Ankit      13
1    87    Teclov      10
2    84  Geekshub      14
3    51     Abhay      11
4    87    Teclov      14

In [75]:
df.tail()

    temp      name  random
15    55    Teclov      10
16    53     Ankit      13
17    38  Geekshub      10
18    85     Abhay      14
19    74    Teclov      12

In [76]:
df.shape

(20, 3)

In [77]:
# checking all the columns name
df.columns

Index(['temp', 'name', 'random'], dtype='object')

In [78]:
# return all the values present in the particular column name
df.name

0        Ankit
1       Teclov
2     Geekshub
3        Abhay
4       Teclov
5       Teclov
6        Ankit
7        Abhay
8        Ankit
9        Abhay
10      Teclov
11    Geekshub
12       Ankit
13       Abhay
14       Ankit
15      Teclov
16       Ankit
17    Geekshub
18       Abhay
19      Teclov
Name: name, dtype: object

In [79]:
df['name']

0        Ankit
1       Teclov
2     Geekshub
3        Abhay
4       Teclov
5       Teclov
6        Ankit
7        Abhay
8        Ankit
9        Abhay
10      Teclov
11    Geekshub
12       Ankit
13       Abhay
14       Ankit
15      Teclov
16       Ankit
17    Geekshub
18       Abhay
19      Teclov
Name: name, dtype: object

In [80]:
df['temp'].describe()

count    20.00000
mean     63.75000
std      21.63057
min      23.00000
25%      50.50000
50%      58.50000
75%      84.25000
max      93.00000
Name: temp, dtype: float64

In [81]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 20 entries, 0 to 19
Data columns (total 3 columns):
temp      20 non-null int32
name      20 non-null object
random    20 non-null int32
dtypes: int32(2), object(1)
memory usage: 304.0+ bytes

In [82]:
df

    temp      name  random
0     23     Ankit      13
1     87    Teclov      10
2     84  Geekshub      14
3     51     Abhay      11
4     87    Teclov      14
5     80    Teclov      14
6     58     Ankit      14
7     92     Abhay      12
8     53     Ankit      11
9     80     Abhay      11
10    49    Teclov      13
11    59  Geekshub      11
12    46     Ankit      13
13    93     Abhay      12
14    28     Ankit      11
15    55    Teclov      10
16    53     Ankit      13
17    38  Geekshub      10
18    85     Abhay      14
19    74    Teclov      12

In [83]:

df.values

array([[23, 'Ankit', 13],
       [87, 'Teclov', 10],
       [84, 'Geekshub', 14],
       [51, 'Abhay', 11],
       [87, 'Teclov', 14],
       [80, 'Teclov', 14],
       [58, 'Ankit', 14],
       [92, 'Abhay', 12],
       [53, 'Ankit', 11],
       [80, 'Abhay', 11],
       [49, 'Teclov', 13],
       [59, 'Geekshub', 11],
       [46, 'Ankit', 13],
       [93, 'Abhay', 12],
       [28, 'Ankit', 11],
       [55, 'Teclov', 10],
       [53, 'Ankit', 13],
       [38, 'Geekshub', 10],
       [85, 'Abhay', 14],
       [74, 'Teclov', 12]], dtype=object)

In [84]:
# making custom index
# here index is set temporarly
df.set_index('temp')

          name  random
temp
23       Ankit      13
87      Teclov      10
84    Geekshub      14
51       Abhay      11
87      Teclov      14
80      Teclov      14
58       Ankit      14
92       Abhay      12
53       Ankit      11
80       Abhay      11
49      Teclov      13
59    Geekshub      11
46       Ankit      13
93       Abhay      12
28       Ankit      11
55      Teclov      10
53       Ankit      13
38    Geekshub      10
85       Abhay      14
74      Teclov      12

In [85]:
# to make the change permanently we pass one extra argument to the set_index method
df

    temp      name  random
0     23     Ankit      13
1     87    Teclov      10
2     84  Geekshub      14
3     51     Abhay      11
4     87    Teclov      14
5     80    Teclov      14
6     58     Ankit      14
7     92     Abhay      12
8     53     Ankit      11
9     80     Abhay      11
10    49    Teclov      13
11    59  Geekshub      11
12    46     Ankit      13
13    93     Abhay      12
14    28     Ankit      11
15    55    Teclov      10
16    53     Ankit      13
17    38  Geekshub      10
18    85     Abhay      14
19    74    Teclov      12

In [86]:
df.set_index('temp', inplace = True)

In [87]:
df

          name  random
temp
23       Ankit      13
87      Teclov      10
84    Geekshub      14
51       Abhay      11
87      Teclov      14
80      Teclov      14
58       Ankit      14
92       Abhay      12
53       Ankit      11
80       Abhay      11
49      Teclov      13
59    Geekshub      11
46       Ankit      13
93       Abhay      12
28       Ankit      11
55      Teclov      10
53       Ankit      13
38    Geekshub      10
85       Abhay      14
74      Teclov      12

In [88]:
df.sort_index(axis = 0, ascending = False)

          name  random
temp
93       Abhay      12
92       Abhay      12
87      Teclov      14
87      Teclov      10
85       Abhay      14
84    Geekshub      14
80      Teclov      14
80       Abhay      11
74      Teclov      12
59    Geekshub      11
58       Ankit      14
55      Teclov      10
53       Ankit      11
53       Ankit      13
51       Abhay      11
49      Teclov      13
46       Ankit      13
38    Geekshub      10
28       Ankit      11
23       Ankit      13

In [89]:
df.sort_values(by = 'random', ascending = False)

          name  random
temp
84    Geekshub      14
85       Abhay      14
87      Teclov      14
80      Teclov      14
58       Ankit      14
23       Ankit      13
46       Ankit      13
53       Ankit      13
49      Teclov      13
93       Abhay      12
92       Abhay      12
74      Teclov      12
80       Abhay      11
59    Geekshub      11
53       Ankit      11
28       Ankit      11
51       Abhay      11
87      Teclov      10
55      Teclov      10
38    Geekshub      10

In [90]:
df.drop(['random'], axis = 1)

          name
temp
23       Ankit
87      Teclov
84    Geekshub
51       Abhay
87      Teclov
80      Teclov
58       Ankit
92       Abhay
53       Ankit
80       Abhay
49      Teclov
59    Geekshub
46       Ankit
93       Abhay
28       Ankit
55      Teclov
53       Ankit
38    Geekshub
85       Abhay
74      Teclov

In [91]:
# again what I have done earlier is temporarly to make it permanently we pass inplace as True
df.head()

          name  random
temp
23       Ankit      13
87      Teclov      10
84    Geekshub      14
51       Abhay      11
87      Teclov      14

In [92]:
df.loc[[0, 1]]

KeyError: "None of [Int64Index([0, 1], dtype='int64', name='temp')] are in the [index]"

In [ ]:
df.iloc[1:3, 1]

In [ ]:
df.iloc[[True, True, False, True]]

In [ ]:
df.head()

In [ ]:
df.iloc[0,:]

In [ ]:
# df.loc[0,:]
df.loc[40, :]

In [ ]:
df.head()

In [ ]:
df.loc[[40, 31, 50]]

In [ ]:
df.loc[[40, 31], 'name' : 'random']

In [ ]:
# df.loc[[True, True, False, True]]

In [ ]:
df.loc[df.random > 13]

In [ ]:
# conditional operations
df.loc[(df.random > 13) | (df.random == 10) ]

In [98]:
df1 = pd.read_csv("weather_data.csv")

In [99]:
df1

        day  temperature  windspeed  event
0  1/1/2017           32          6   Rain
1  1/2/2017           35          7  Sunny
2  1/3/2017           28          2   Snow
3  1/4/2017           24          7   Snow
4  1/5/2017           32          4   Rain
5  1/6/2017           31          2  Sunny

In [101]:
# save to anothe file format like exel
# pip3 install openpyxl
df1.to_excel('weather_data.xlsx', sheet_name='weathe_data')

In [104]:
# to read excel file install xlrd
# pip3 install xlrd
df2 = pd.read_excel('weather_data.xlsx')

In [105]:
df2

   Unnamed: 0       day  temperature  windspeed  event
0           0  1/1/2017           32          6   Rain
1           1  1/2/2017           35          7  Sunny
2           2  1/3/2017           28          2   Snow
3           3  1/4/2017           24          7   Snow
4           4  1/5/2017           32          4   Rain
5           5  1/6/2017           31          2  Sunny

In [106]:
df1.to_excel('weather_data_noindex.xlsx', index = False)

In [107]:
df3 = pd.read_excel('weather_data_noindex.xlsx')

In [108]:
df3

        day  temperature  windspeed  event
0  1/1/2017           32          6   Rain
1  1/2/2017           35          7  Sunny
2  1/3/2017           28          2   Snow
3  1/4/2017           24          7   Snow
4  1/5/2017           32          4   Rain
5  1/6/2017           31          2  Sunny

### Merging and Concat

In [109]:
d1 = pd.DataFrame([['a', 1], ['b', 2]], columns = ['col1', 'number'])
d2 = pd.DataFrame([['c', 3, 'lion'], ['d', 4, 'tiger']], columns = ['letter', 'number', 'animal'])

In [110]:
d1

  col1  number
0    a       1
1    b       2

In [111]:
d2

  letter  number animal
0      c       3   lion
1      d       4  tiger

In [119]:
# concatenating row wise
pd.concat([d1, d2], axis = 0, sort = False)

  col1  number letter animal
0    a       1    NaN    NaN
1    b       2    NaN    NaN
0  NaN       3      c   lion
1  NaN       4      d  tiger

In [117]:
pd.concat([d1, d2], axis = 0, ignore_index = True, sort = False)

  col1  number letter animal
0    a       1    NaN    NaN
1    b       2    NaN    NaN
2  NaN       3      c   lion
3  NaN       4      d  tiger

In [116]:
pd.concat([d1, d2], axis = 1, sort = True)

  col1  number letter  number animal
0    a       1      c       3   lion
1    b       2      d       4  tiger

### Groupby

In [120]:
df2 = pd.read_csv("weather_data.csv")

In [122]:
df_group = df2.groupby("event")

In [123]:
df_group

In [124]:
df2

        day  temperature  windspeed  event
0  1/1/2017           32          6   Rain
1  1/2/2017           35          7  Sunny
2  1/3/2017           28          2   Snow
3  1/4/2017           24          7   Snow
4  1/5/2017           32          4   Rain
5  1/6/2017           31          2  Sunny

In [125]:
for temperature in df_group:
    print(temperature)

('Rain',         day  temperature  windspeed event
0  1/1/2017           32          6  Rain
4  1/5/2017           32          4  Rain)
('Snow',         day  temperature  windspeed event
2  1/3/2017           28          2  Snow
3  1/4/2017           24          7  Snow)
('Sunny',         day  temperature  windspeed  event
1  1/2/2017           35          7  Sunny
5  1/6/2017           31          2  Sunny)

In [126]:
df_group.get_group('Rain')

        day  temperature  windspeed event
0  1/1/2017           32          6  Rain
4  1/5/2017           32          4  Rain

In [127]:
df_group.describe()

      temperature                                               windspeed  \
            count  mean       std   min   25%   50%   75%   max     count
event
Rain          2.0  32.0  0.000000  32.0  32.0  32.0  32.0  32.0       2.0
Snow          2.0  26.0  2.828427  24.0  25.0  26.0  27.0  28.0       2.0
Sunny         2.0  33.0  2.828427  31.0  32.0  33.0  34.0  35.0       2.0


      mean       std  min   25%  50%   75%  max
event
Rain   5.0  1.414214  4.0  4.50  5.0  5.50  6.0
Snow   4.5  3.535534  2.0  3.25  4.5  5.75  7.0
Sunny  4.5  3.535534  2.0  3.25  4.5  5.75  7.0

In [129]:
def hot_temp(x):
    return x > 30

### Adding new column to a pandas DataFrame

In [130]:
df2['hot_temp'] = df2['temperature'].apply(hot_temp)

In [131]:
df2

        day  temperature  windspeed  event  hot_temp
0  1/1/2017           32          6   Rain      True
1  1/2/2017           35          7  Sunny      True
2  1/3/2017           28          2   Snow     False
3  1/4/2017           24          7   Snow     False
4  1/5/2017           32          4   Rain      True
5  1/6/2017           31          2  Sunny      True

In [133]:
df2['hot_temp_lambda'] = df2['temperature'].apply(lambda x : x > 30)

In [134]:
df2

        day  temperature  windspeed  event  hot_temp  hot_temp_lambda
0  1/1/2017           32          6   Rain      True             True
1  1/2/2017           35          7  Sunny      True             True
2  1/3/2017           28          2   Snow     False            False
3  1/4/2017           24          7   Snow     False            False
4  1/5/2017           32          4   Rain      True             True
5  1/6/2017           31          2  Sunny      True             True

### Merging part-2

In [135]:
d1 = pd.DataFrame({
    "city" : ["lucknow", "kanpur", "agra", "delhi"],
    "tempeature" : [32, 45, 30, 40]
})

In [136]:
d1

      city  tempeature
0  lucknow          32
1   kanpur          45
2     agra          30
3    delhi          40

In [137]:
d2 = pd.DataFrame({
    "city" : ["delhi", "kanpur", "agra"],
    "humidity" : [68, 65, 75]
})

In [138]:
d2

     city  humidity
0   delhi        68
1  kanpur        65
2    agra        75

In [139]:
df = pd.merge(d1, d2, on='city')

In [140]:
df

     city  tempeature  humidity
0  kanpur          45        65
1    agra          30        75
2   delhi          40        68

In [141]:
# merging with respect to outer join
pd.merge(d1, d2, on = ['city'], how='outer')

      city  tempeature  humidity
0  lucknow          32       NaN
1   kanpur          45      65.0
2     agra          30      75.0
3    delhi          40      68.0

In [142]:
# merging with respect to left join
pd.merge(d1, d2, on = ['city'], how='left')

      city  tempeature  humidity
0  lucknow          32       NaN
1   kanpur          45      65.0
2     agra          30      75.0
3    delhi          40      68.0

### Pivot Table

In [145]:
# pivot table is an alternative of groupby
df2.pivot_table(values = 'temperature', index ='event', aggfunc = 'mean')

       temperature
event
Rain            32
Snow            26
Sunny           33

In [146]:
df2.pivot_table(columns='temperature')

temperature         24     28    31    32    35
hot_temp         False  False  True  True  True
hot_temp_lambda  False  False  True  True  True
windspeed            7      2     2     5     7

### Help Page for Pandas methods and function

In [148]:
help(pd.DataFrame.pivot_table)

Help on function pivot_table in module pandas.core.frame:

pivot_table(self, values=None, index=None, columns=None, aggfunc='mean', fill_value=None, margins=False, dropna=True, margins_name='All', observed=False)
    Create a spreadsheet-style pivot table as a DataFrame. The levels in
    the pivot table will be stored in MultiIndex objects (hierarchical
    indexes) on the index and columns of the result DataFrame.

    Parameters
    ----------
    values : column to aggregate, optional
    index : column, Grouper, array, or list of the previous
        If an array is passed, it must be the same length as the data. The
        list can contain any of the other types (except list).
        Keys to group by on the pivot table index.  If an array is passed,
        it is being used as the same manner as column values.
    columns : column, Grouper, array, or list of the previous
        If an array is passed, it must be the same length as the data. The
        list can contain any of the other types (except list).
        Keys to group by on the pivot table column.  If an array is passed,
        it is being used as the same manner as column values.
    aggfunc : function, list of functions, dict, default numpy.mean
        If list of functions passed, the resulting pivot table will have
        hierarchical columns whose top level are the function names
        (inferred from the function objects themselves)
        If dict is passed, the key is column to aggregate and value
        is function or list of functions
    fill_value : scalar, default None
        Value to replace missing values with
    margins : boolean, default False
        Add all row / columns (e.g. for subtotal / grand totals)
    dropna : boolean, default True
        Do not include columns whose entries are all NaN
    margins_name : string, default 'All'
        Name of the row / column that will contain the totals
        when margins is True.
    observed : boolean, default False
        This only applies if any of the groupers are Categoricals.
        If True: only show observed values for categorical groupers.
        If False: show all values for categorical groupers.

        .. versionchanged :: 0.25.0

    Returns
    -------
    DataFrame

    See Also
    --------
    DataFrame.pivot : Pivot without aggregation that can handle
        non-numeric data.

    Examples
    --------
    >>> df = pd.DataFrame({"A": ["foo", "foo", "foo", "foo", "foo",
    ...                          "bar", "bar", "bar", "bar"],
    ...                    "B": ["one", "one", "one", "two", "two",
    ...                          "one", "one", "two", "two"],
    ...                    "C": ["small", "large", "large", "small",
    ...                          "small", "large", "small", "small",
    ...                          "large"],
    ...                    "D": [1, 2, 2, 3, 3, 4, 5, 6, 7],
    ...                    "E": [2, 4, 5, 5, 6, 6, 8, 9, 9]})
    >>> df
         A    B      C  D  E
    0  foo  one  small  1  2
    1  foo  one  large  2  4
    2  foo  one  large  2  5
    3  foo  two  small  3  5
    4  foo  two  small  3  6
    5  bar  one  large  4  6
    6  bar  one  small  5  8
    7  bar  two  small  6  9
    8  bar  two  large  7  9

    This first example aggregates values by taking the sum.

    >>> table = pd.pivot_table(df, values='D', index=['A', 'B'],
    ...                     columns=['C'], aggfunc=np.sum)
    >>> table
    C        large  small
    A   B
    bar one    4.0    5.0
        two    7.0    6.0
    foo one    4.0    1.0
        two    NaN    6.0

    We can also fill missing values using the `fill_value` parameter.

    >>> table = pd.pivot_table(df, values='D', index=['A', 'B'],
    ...                     columns=['C'], aggfunc=np.sum, fill_value=0)
    >>> table
    C        large  small
    A   B
    bar one      4      5
        two      7      6
    foo one      4      1
        two      0      6

    The next example aggregates by taking the mean across multiple columns.

    >>> table = pd.pivot_table(df, values=['D', 'E'], index=['A', 'C'],
    ...                     aggfunc={'D': np.mean,
    ...                              'E': np.mean})
    >>> table
                    D         E
    A   C
    bar large  5.500000  7.500000
        small  5.500000  8.500000
    foo large  2.000000  4.500000
        small  2.333333  4.333333

    We can also calculate multiple types of aggregations for any given
    value column.

    >>> table = pd.pivot_table(df, values=['D', 'E'], index=['A', 'C'],
    ...                     aggfunc={'D': np.mean,
    ...                              'E': [min, max, np.mean]})
    >>> table
                    D    E
                mean  max      mean  min
    A   C
    bar large  5.500000  9.0  7.500000  6.0
        small  5.500000  9.0  8.500000  8.0
    foo large  2.000000  5.0  4.500000  4.0
        small  2.333333  6.0  4.333333  2.0